## Desafio 01. Segundo maior salário

### Bibliotecas

In [1]:
import pandas as pd

# Módulo de conexão com banco
import sys
sys.path.append('../') 
import funcoesconexao as con

# Desativa warnings
import warnings
warnings.filterwarnings('ignore')

### Carregamento dos Dados

#### Via banco de dados — SQL Server

In [2]:
conexao = con.conectar_bd()

----- Conexão com banco de dados estabelecida com sucesso! -----

In [3]:
# Carregando dataframes
df_departamentos = con.carregar_dados(conexao, 'departamentos')
df_funcionarios  = con.carregar_dados(conexao, 'funcionarios')

# Fechando conexão
con.fechar_conexao_bd(conexao)

In [4]:
# Exibindo dataframes
display(df_departamentos.head())
display(df_funcionarios.head())

   id              nome
0   1  Recursos Humanos
1   2         Marketing
2   3        Engenharia
3   4            Vendas
4   5        Financeiro

   id    nome sobrenome  salario  departamento_id
0   1    João     Silva     3000                1
1   2   Maria     Souza     4000                2
2   3  Carlos  Oliveira     6500                3
3   4     Ana   Pereira     3200                1
4   5   Pedro     Costa     3900                2

#### Via arquivo .CSV

In [5]:
# Carregando dataframes
df_departamentos = con.carregar_dados_csv('departamentos.csv')
df_funcionarios  = con.carregar_dados_csv('funcionarios.csv')

In [6]:
# Exibindo dataframes
display(df_departamentos.head())
display(df_funcionarios.head())

   id              nome
0   1  Recursos Humanos
1   2         Marketing
2   3        Engenharia
3   4            Vendas
4   5        Financeiro

   id    nome sobrenome  salario  departamento_id
0   1    João     Silva     3000                1
1   2   Maria     Souza     4000                2
2   3  Carlos  Oliveira     6500                3
3   4     Ana   Pereira     3200                1
4   5   Pedro     Costa     3900                2

### Solução

In [7]:
def segundo_maior_salario(departamentos: pd.DataFrame, funcionarios: pd.DataFrame):
    # Mesclando dataframes
    df_merge = pd.merge(funcionarios, departamentos, left_on='departamento_id', right_on='id', how='inner')
    
    # Filtrando apenas departamento Engenharia
    df_engenharia = df_merge[df_merge['nome_y'] == 'Engenharia']
    
    # Ordenando salários em ordem decrescente
    salarios_ordenados = df_engenharia['salario'].sort_values(ascending=False)
    
    # Tratativa para segundo maior salário
    if salarios_ordenados.iloc[0] == salarios_ordenados.iloc[1]:
        segundo_maior = salarios_ordenados.iloc[2]
    else:
        segundo_maior = salarios_ordenados.iloc[1]
    
    # Cria dataframe de saída   
    df = pd.DataFrame({'salario': [segundo_maior]})
    
    # Saída
    return df

In [8]:
segundo_maior_salario(df_departamentos, df_funcionarios)

   salario
0     6000